Revit 2027 API
BuiltInFailures.SketchFailures.ShortCurveInSketch Property
 The sketch contains an extremely short line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ShortCurveInSketch { get; }
Public Shared ReadOnly Property ShortCurveInSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ShortCurveInSketch {
	FailureDefinitionId^ get ();
}
static member ShortCurveInSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace